class Mapping:
    SUBJECTS = {
        'технология разработки и защиты баз данных': "ТРиЗБД",
        'инфокоммуникационные системы и сети': "ИСиС",
        'инструментальные средства разработки программного обеспечения': "ИСРПО",
        'технические средства информатизации': "ТСИ",
        'микропроцессорные системы': "МС",
        'компьютерные сети': "КС",
        'наладчик технологического оборудования': "НТО",
        'правовое обеспечение профессиональной деятельности': "ПОПД",
        'физическая культура': "Физ-ра",
        'иностранный язык': "Ин. язык",
    }
    EXERCISES = {
        'лаб. раб.': "ЛР  ",
        'практика': "ПР  ",
        'лекция': "Лек "
    }
    CLASSROOMS = {
        'спортзал': 'с/з',
    }


class ColumnIndex:
    WEEKDAY = 1
    GROUP = 0
    TIME = 2
    SUBJECT = 4
    EXERCISE = 5
    CLASSROOM = 6
    BUILDING = 7
    FIO = 8


SHEET_NAME = "Лист1"

WEEKDAYS = {
    'пн': 1,
    'вт': 2,
    'ср': 3,
    'чт': 4,
    'пт': 5,
    'сб': 6,
    'вс': 7,
}

OUTPUT_COLORS = [
    "#34a434",  # green
    "#a4a41f",  # yellow
    "#e09a1a",  # orange
    "#15a0a0",  # blue
    "#a613a6",  # purple
    "#f22121",  # red
]

OUTPUT_FILE = 'output.html'
